	IDENTIFICATION DIVISION.
		PROGRAM-ID. POLE-KOLA.

	DATA DIVISION.
		WORKING-STORAGE SECTION.
			01	PI			PIC 9(1)V9(5) VALUE 3.14159.
			01	USR_INPUT	PIC 9(100).
			01	RADIUS		PIC 9(100).
			01	CIRCLE		PIC 9(100)V9(100).
			01	IS_VALID	PIC 9 VALUE 0.
			01	TEMP		PIC 9(100)V9(100).

	PROCEDURE DIVISION.
		DISPLAY "Obliczanie pola kola".
		PERFORM GET-USER-INPUT.
		PERFORM CALCULATE.
		PERFORM DISP-RESULT.

		STOP RUN.


	GET-USER-INPUT.
		DISPLAY "Podaj promien:".

		PERFORM UNTIL IS_VALID = 1
			ACCEPT USR_INPUT

			IF USR_INPUT IS NUMERIC
				MOVE USR_INPUT TO RADIUS
				MOVE 1 TO IS_VALID
			ELSE
				DISPLAY "Podaj cyfre"
			END-IF
		END-PERFORM.

	CALCULATE.
		COMPUTE TEMP = PI * RADIUS.
		COMPUTE CIRCLE = TEMP / 2.

	DISP-RESULT.
		DISPLAY "Pole kola: " CIRCLE.
