IDENTIFICATION DIVISION.
	PROGRAM-ID. ASK-NAME.

DATA DIVISION.
	WORKING-STORAGE SECTION.
		01	USER-NAME	PIC A(100).

PROCEDURE DIVISION.
	*> Wywoływanie funkcji - PERFORM
	PERFORM ASK-NAME.
	PERFORM SAY-HELLO.

	STOP RUN.


ASK-NAME.
	DISPLAY "What's your name?: ".
	ACCEPT USER-NAME.

SAY-HELLO.
	DISPLAY "Hello, " USER-NAME "!".	*> Trza dać nową linię na końcu!!!1!111!!!
