*> By Onko Aikuu @furry_onko
*> Program repeating text

	IDENTIFICATION DIVISION.
		PROGRAM-ID. LOOP-TEXT.

	DATA DIVISION.
		WORKING-STORAGE SECTION.
			01	I			PIC 9(20) VALUE 0.
			01	REP_TEXT	PIC X(100).
			01	REPEAT		PIC 9(20) VALUE 0.
			01	IS_VALID	PIC 9 VALUE 0.
			01	LEN			PIC 9(5) VALUE 0.
			01	BUFFER		PIC X(120).
			01	STR_I		PIC Z(20).

	PROCEDURE DIVISION.
		PERFORM INP-TEXT.
		PERFORM INP-NUMBER.
		PERFORM RUN-LOOP.

		STOP RUN.

	INP-TEXT.
		PERFORM UNTIL IS_VALID = 1
			DISPLAY "What text should I repeat?: " WITH NO ADVANCING
			ACCEPT REP_TEXT

			INSPECT FUNCTION TRIM (REP_TEXT) TALLYING LEN FOR CHARACTERS
			IF LEN = 0
				DISPLAY "String cannot be empty."
			ELSE
				MOVE 1 TO IS_VALID
			END-IF
		END-PERFORM.

	INP-NUMBER.
		MOVE 0 TO IS_VALID
		MOVE 0 TO LEN

		PERFORM UNTIL IS_VALID = 1
			DISPLAY "How many times should i repeat?: " WITH NO ADVANCING
			ACCEPT REPEAT

			IF REPEAT IS NUMERIC
				INSPECT FUNCTION TRIM (REPEAT) TALLYING LEN FOR CHARACTERS
				IF LEN = 0
					DISPLAY "Type a number."
				ELSE
					MOVE 1 TO IS_VALID
				END-IF
			ELSE
				DISPLAY "You need to type a number."
			END-IF
		END-PERFORM.

	RUN-LOOP.
		PERFORM VARYING I FROM 1 BY 1 UNTIL I > REPEAT
			MOVE I TO STR_I
			STRING FUNCTION TRIM (STR_I) DELIMITED BY SIZE
				". " DELIMITED BY SIZE
				REP_TEXT DELIMITED BY SIZE
				INTO BUFFER
			DISPLAY BUFFER

			MOVE 0 TO STR_I
			MOVE SPACES TO BUFFER
		END-PERFORM.
